gicking/STM8_headers/SVD/STM8L101F2.svd
<?xml version="1.0" encoding="utf-8"?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>STMicroelectronics</vendor>
  <name>STM8L101F2</name>
  <version>1.0</version>
  <series>STM8L101, low density</series>
  <description>Ultra-low-power 8-bit MCU with 4 Kbytes Flash, 16 MHz CPU, integrated EEPROM </description>
  <cpu>
    <name>other</name>
    <revision>r1p0</revision>
    <endian>big</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <fpuDP>false</fpuDP>
    <dspPresent>false</dspPresent>
    <icachePresent>false</icachePresent>
    <dcachePresent>false</dcachePresent>
    <itcmPresent>false</itcmPresent>
    <dtcmPresent>false</dtcmPresent>
    <vtorPresent>false</vtorPresent>
  </cpu>
  <size>8</size>
  <width>8</width>
  <addressUnitBits>8</addressUnitBits>
  <access>read-write</access>
  <peripherals>
    <peripheral>
      <name>AWU</name>
      <baseAddress>0x50F0</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>3</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AWU</description>
      <groupName>AWU</groupName>
      <registers>
        <register>
          <name>CSR</name>
          <description>AWU control/status register</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>MSR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWUEN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWUF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APR</name>
          <description>AWU asynchronous prescaler buffer register</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x3F</resetValue>
          <fields>
            <field>
              <name>APR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBR</name>
          <description>AWU timebase selection register</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>AWUTB</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
      <interrupt>
        <name>AWU_AWU</name>
        <description>AWU_AWU interrupt</description>
        <value>4</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>BEEP</name>
      <baseAddress>0x50F3</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <description>BEEP</description>
      <groupName>BEEP</groupName>
      <registers>
        <register>
          <name>CSR</name>
          <description>BEEP control/status register</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x1F</resetValue>
          <fields>
            <field>
              <name>BEEPDIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>BEEPEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BEEPSEL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CLK</name>
      <baseAddress>0x50C0</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0003</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0005</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <description>CLK</description>
      <groupName>CLK</groupName>
      <registers>
        <register>
          <name>CKDIVR</name>
          <description>Clock divider register</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x03</resetValue>
          <fields>
            <field>
              <name>HSIDIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCKENR</name>
          <description>Peripheral clock gating register</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PCKEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCOR</name>
          <description>Configurable clock control register</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC0EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCOSEL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
