gicking/STM8_headers/SVD/STM8L101F2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP</name>
      <baseAddress>0x5300</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>3</size>
        <usage>registers</usage>
      </addressBlock>
      <description>CMP</description>
      <groupName>CMP</groupName>
      <registers>
        <register>
          <name>CR</name>
          <description>Comparator control register</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>BIAS_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPREF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNF_TIM0</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNF_TIM1</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC1_BK</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>Comparator status register</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>COMP1_OUT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2_OUT</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEF1</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITEN1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEF2</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITEN2</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCS</name>
          <description>Comparator channel selection register</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>COMP1_CH1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1_CH2</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1_CH3</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1_CH4</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2_CH1</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2_CH2</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2_CH3</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2_CH4</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <baseAddress>0x7F00</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>11</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0060</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <description>CPU</description>
      <groupName>CPU</groupName>
      <registers>
        <register>
          <name>A</name>
          <description>Accumulator</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PCE</name>
          <description>Program counter extended</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PCH</name>
          <description>Program counter high</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PCL</name>
          <description>Program counter low</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>XH</name>
          <description>X index register high</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>XL</name>
          <description>X index register low</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>YH</name>
          <description>Y index register high</description>
          <size>8</size>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>YL</name>
          <description>Y index register low</description>
          <size>8</size>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>SPH</name>
          <description>Stack pointer high</description>
          <size>8</size>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x03</resetValue>
        </register>
        <register>
          <name>SPL</name>
          <description>Stack pointer low</description>
          <size>8</size>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>CCR</name>
          <description>Condition code register</description>
          <size>8</size>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0x28</resetValue>
          <fields>
            <field>
              <name>C</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Z</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>N</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I0</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>H</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>V</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_GCR</name>
          <description>Global configuration register</description>
          <size>8</size>
          <addressOffset>0x0060</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SWD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
