gicking/STM8_headers/SVD/STM8L101F2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DM</name>
      <baseAddress>0x7F90</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>11</size>
        <usage>registers</usage>
      </addressBlock>
      <description>DM</description>
      <groupName>DM</groupName>
      <registers>
        <register>
          <name>BK1RE</name>
          <description>Breakpoint 1 register extended byte</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK1RH</name>
          <description>Breakpoint 1 register high byte</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK1RL</name>
          <description>Breakpoint 1 register low byte</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RE</name>
          <description>Breakpoint 2 register extended byte</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RH</name>
          <description>Breakpoint 2 register high byte</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RL</name>
          <description>Breakpoint 2 register low byte</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>CR1</name>
          <description>Debug module control register 1</description>
          <size>8</size>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>CR2</name>
          <description>Debug module control register 2</description>
          <size>8</size>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>CSR1</name>
          <description>Debug module control/status register 1</description>
          <size>8</size>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x10</resetValue>
        </register>
        <register>
          <name>CSR2</name>
          <description>Debug module control/status register 2</description>
          <size>8</size>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>ENFCTR</name>
          <description>Enable function register</description>
          <size>8</size>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <baseAddress>0x5050</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>5</size>
        <usage>registers</usage>
      </addressBlock>
      <description>FLASH</description>
      <groupName>FLASH</groupName>
      <registers>
        <register>
          <name>CR1</name>
          <description>Flash control register 1</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>FIX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Flash control register 2</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPRG</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERASE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPRG</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUKR</name>
          <description>Flash Program memory unprotection register</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>MASS_PRG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DUKR</name>
          <description>Data EEPROM unprotection register</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>MASS_DATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IAPSR</name>
          <description>Flash in-application programming status register</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>WR_PG_DIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PUL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOP</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DUL</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
